{
    "new_user": {
        "activities": ["College Study FAQs"],
        "daily": ["none"],
        "times": [0],
        "message": "Welcome to the College Study! Please take a look at the College Study FAQs Learn Tip (which can be found in the feed or the learn tab). Each morning, users are moved to the Trial Period. Look out for the Trial Period surveys which will be added to your feed. Please email us if you have any questions!"
    },
    "trial_period": {
        "activities": ["Trial Period Day 1",
                       "Trial Period Day 2",
                       "Trial Period Day 3"],
        "daily": ["none", "none", "none"],
        "times": [0, 86400000, 172800000],
        "message": ""
    },
    "daily_and_weekly": {
        "activities": ["Morning Daily Survey", "Weekly Survey", "Weekly Survey (long)"],
        "daily": ["daily", "weekly", "none"],
        "times": [-36000000, 518400000, 0],
        "message": ""
    },
    "gratitude_journal": {
        "activities": ["Gratitude",
                       "Gratitude Journal Day 1",
                       "Gratitude Journal Day 2",
                       "Gratitude Journal Day 3",
                       "Gratitude Journal Day 4",
                       "Gratitude Journal Day 5",
                       "Gratitude Journal Day 6"],
        "daily": ["none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none"],
        "times": [0,
                   60000,
                   86400000,
                   172800000,
                   259200000,
                   345600000,
                   432000000],
        "message": "This week's module centers around gratitude. Practicing gratitude regularly has been shown to increase positive emotions and improve well-being. This week, you will see a Learn Tip with a video explaining why gratitude is important and how it can improve our mental wellness. Next, each day you will have activities asking you to reflect and express gratitude for things that happened in your day. Try to include some detail in your response to get a sense of why this person / event / thing was important to you. Each day's activity will have different prompts. Remember, you can always access your past responses in the 'Portal' Page if you want to reflect on these gratitude entries."
    },
    "mindfulness": {
        "activities": ["Mindfulness",
                        "Morning 1-Minute Mindfulness",
                        "Day 1 - 5-4-3-2-1 Grounding Technique",
                        "Day 2 - Breathe with your Body",
                        "Day 3 - Breathing Exercise (Long)",
                        "Day 4 - 3 Minute Mindfulness Breathing",
                        "Day 5 - 5 Minute Self-Compassion Mindfulness",
                        "Day 6 - 6 minute mindfulness"],
        "daily": ["none",
                  "daily",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none"],
        "times": [0,
                  50400000,
                  60000,
                  86400000,
                  172800000,
                  259200000,
                  345600000,
                  432000000],
        "message": "This week, you will complete the 'mindfulness' module. Today there is a Learn Tip about mindfulness. In the first section there’s a video explanating what mindfulness is. After today, you will get notification about a mindfulness activity each morning. These are always the same 1-minute audio. Every evening there is another mindfulness activity. Some of these may be longer than others."
    },
    "games": {
        "activities": ["Jewels Game",
                       "Spatial Span Game",
                       "Jewels Game",
                       "Spatial Span Game",
                       "Jewels Game",
                       "Spatial Span Game",
                       "Jewels Game"],
        "daily": ["none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none"],
        "times": [0,
                  86400000,
                  172800000,
                  259200000,
                  345600000,
                  432000000,
                  518400000],
        "message": "This week's module focuses on cognitive enhancement therapy. There are 2 'brain games' that you'll be assigned to play throughout the week. Although there are instructions on each game when you open it, you can always come back to this message to read the more detailed instructions. The first game is called Jewels. How it works is that when you open the game and click 'begin' there will be a screen full of shapes with numbers inside of them. At the bottom of the screen, it will show you a certain shape with the number 1 inside of it. You should find that jewel on the screen and click it. Then, it will show you a jewel of the second shape with the number 1 on it, and you'll click that one. You'll repeat this pattern for all of the jewels. The second game is called 'Spatial Span'. For this one, you will see a grid of boxes. Boxes will light up in a certain order. Remember that order and then tap those same boxes in **REVERSE ORDER** from how they appeared. Each level will have more boxes in lit up in the sequence. See how far you can get!"
    },
    "thought_patterns_a": {
        "activities": ["Identifying Thought Patterns",
                       "Thought Patterns: Catastrophizing",
                       "Thought Patterns: All-or-Nothing Thinking",
                       "Record, Rationalize, Replace",
                       "Thought Patterns: Jumping to Conclusions",
                       "Thought Patterns: Mind Reading",
                       "Record, Rationalize, Replace"],
        "daily": ["none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none"],
        "times": [0,
                  86400000,
                  172800000,
                  259200000,
                  345600000,
                  432000000,
                  518400000],
        "message": "This week you will complete the first 'thought patterns' module. In your feed you’ll see that there’s a 'Learn Tip' assigned for today called Identifying Thought Patterns. This tip will teach you about what Thought Patterns are and has a list of common Thought Patterns. The activities during the week will walk you through four of these Thought Patterns: Catastrophizing, All-or-Nothing Thinking, Jumping to Conclusions, and Mind Reading. Throughout the week you will also have the Record, Rationalize, Replace activity where you can practice applying the thought patterns you've learned. If you can't think of an example in your own life, either make one up to analyze or use one of the examples from the activity."
    },
    "thought_patterns_b": {
        "activities": ["Identifying Thought Patterns",
                       "Thought Patterns: Fortune Telling",
                       "Thought Patterns: Minimizing",
                       "Thought Patterns: Emotional Reasoning",
                       "Record, Rationalize, Replace",
                       "Thought Patterns: Should-y Thinking",
                       "Thought Patterns: Personalization",
                       "Record, Rationalize, Replace"],
        "daily": ["none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none",
                  "none"],
        "times": [0,
                  6000,
                  86400000,
                  172800000,
                  259200000,
                  345600000,
                  432000000,
                  518400000],
        "message": "This week you will complete the second 'thought patterns' module. In your feed you’ll see that there’s a 'Learn Tip' assigned for today called Identifying Thought Patterns. This is the same learn tip as last time, so it should be review. The activities during the week will walk you through five new Thought Patterns: Fortune Telling, Minimizing, Emotional Reasoning, Should-y Thinking, and Personalization Throughout the week you will also have the Record, Rationalize, Replace activity where you can practice applying the thought patterns you've learned. If you can't think of an example in your own life, either make one up to analyze or use one of the examples from the activity."
    },
    "strengths": {
        "activities": ["Strengths",
                       "Strengths Survey"],
        "daily": ["none",
                  "daily"],
        "times": [0,
                  60000],
        "message": "This week's module focuses on identifying your strengths and recognizing them in your daily life. Focusing on how you use your strengths is a superb way to build self-confidence and feelings of self-worth. You will start by watching the video in the Learn tip about strengths. You can also refer to the list of positive traits in the learn tip to get started thinking about your personal strengths! Then, every day you will make a plan for how you are going to employ your strength. In the evening you will answer a 2-question survey to reflect on whether you were able to carry out your plan."
    },
    "behavioral_activation": {
        "activities": ["Behavioral Activation",
                       "Behavioral Activation Activity"],
        "daily": ["none",
                  "daily"],
        "times": [0, 60000],
        "message": "This week you will complete the 'behavioral activation' module. Behavioral activation has to do with the way that behaviors and feelings can impact each other. This module should help you examine how certain activities can impact your mood. First, as usual, you can view the tip to learn about behavioral activation. Then, each day there is an activity that will ask you to think about an activity you did that day, rate how easy or difficult it was for you to do, and think about how doing that activity influenced your mood or mental health symptoms. The goal is to have a list of activities at the end of the week that you know to be beneficial for your mental health."
    }
}
